{
  "Align": { "branch": "master" },
  "CopilotChat.nvim": { "branch": "main" },
  "RadicalGoodSpeed": { "branch": "master" },
  "YankRing.vim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "emmet-vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "leap.nvim": { "branch": "main" },
  "markdown-preview.nvim": { "branch": "master" },
  "marp.nvim": { "branch": "main" },
  "neotest": { "branch": "master" },
  "neotest-playwright": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-treesitter": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "oil-git-status.nvim": { "branch": "main" },
  "oil.nvim": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-pug": { "branch": "master" },
  "vim-pug-complete": { "branch": "master" },
  "vim-quickrun": { "branch": "master" },
  "vim-surround": { "branch": "master" }
}
